<script setup lang='ts'>
import { NSpin } from "naive-ui";
</script>

<template>
  <NSpin>
    <div class="p-4 space-y-4">
      <h2 class="text-xl font-bold">
        网站责任声明
      </h2>
      <div class="p-2 space-y-2 rounded-md bg-neutral-100 dark:bg-neutral-700">
        <p>
            欢迎来到本网站。我们致力于为访问者提供高质量的内容和服务。在使用本网站之前，请仔细阅读以下条款和条件。
        </p>
        <p>
            我们不保证本网站所提供的信息是完全准确、完整、实时的。因此，我们不对用户因依赖本网站所提供的信息而造成的任何损失或损害承担任何责任。
        </p>
        <p>
            我们不对本网站的中断、延误、故障和与网络有关的其他问题负责。我们无法保证本网站将始终不间断地运行或没有错误，也无法保证用户能够访问本网站。我们不对由于本网站无法访问或使用而导致的任何直接或间接损失或损害承担任何责任。
        </p>
        <p>
            本网站可能包含指向其他网站的链接，这些链接仅用于方便用户。当用户访问这些链接时，将离开本网站并进入第三方网站。我们不对任何第三方网站的内容、隐私政策或使用情况负责。我们鼓励用户在离开本网站前仔细阅读第三方网站的条款和条件。
        </p>
        <p>
            我们保留在不提前通知用户的情况下随时更改本网站条款和条件的权利。请用户定期查看此页面以了解有关更改的信息。
        </p>
        <p>
            我们非常重视用户的隐私。我们将采取合理的措施保护用户个人信息的安全和机密性。我们不会泄露用户的个人信息或将其提供给第三方，除非被法律要求或受合法调查程序要求。
        </p>
        <p>
            感谢您使用本网站！
        </p>
      </div>
    </div>
  </NSpin>
</template>
